ipmsApp/app/controllers/surveys_controller.rb

INSERT INTO "surveys" ("organisation", "city", "office", "building", "floor", "area", "building_type", "component", "ipms", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #render plain: params[:survey].inspect
    @survey = Survey.new(survey_params)
    @survey.save

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @survey = Survey.find(params[:id])

SELECT "surveys".* FROM "surveys" WHERE "surveys"."organisation" = ? AND "surveys"."city" = ? AND "surveys"."office" = ? AND "surveys"."building" = ? AND "surveys"."floor" = ? ORDER BY "surveys"."ipms" DESC  [["organisation", "Wipro"], ["city", "Bangalore"], ["office", "Wipro Corporate Office, Sarjapur"], ["building", "Wipro Corporate Office"], ["floor", "1"]]
SELECT "surveys"."area" FROM "surveys" WHERE "surveys"."organisation" = ? AND "surveys"."city" = ? AND "surveys"."office" = ? AND "surveys"."building" = ? AND "surveys"."floor" = ? AND "surveys"."ipms" = ? AND "surveys"."component" = ? ORDER BY "surveys"."ipms" DESC  [["organisation", "Wipro"], ["city", "Bangalore"], ["office", "Wipro Corporate Office, Sarjapur"], ["building", "Wipro Corporate Office"], ["floor", "1"], ["ipms", "1"], ["component", "Comp A"]]
---
  def searchResults
    if params[:city]
      city = params[:city]
      office = params[:office]
      building = params[:building]
      organisation = "Wipro"

      building = building.split(",").first
      floor = 1
      @surveys = Survey.where(organisation: organisation, city: city, office: office, building: building, floor: 1).order(ipms: :desc)
      @queryString = city + ", " + office + ", " + building
      @organisation = organisation
      #send_file Rails.root.join("public", "IPMS1.png"), type: "image/png", disposition: "inline"
      @IPMS1 = "IPMS1.png"
      @IPMS2 = "IPMS2.png"
      @IPMS3 = "IPMS3.png"

      # do the calculation part
      @ipms_1_comp_a = @surveys.where(ipms: 1, component: "Comp A").pluck(:area).first.to_f

SELECT "surveys".* FROM "surveys"
---
  def index
    @surveys = Survey.all