ipmsApp/app/controllers/surveys_controller.rb

  def searchResults
      if params[:city]
        city = params[:city]
  	  	office = params[:office]
  	  	building = params[:building]
        organisation = "Wipro"

        building = building.split(",").first
      	floor = 1
      	@surveys = Survey.where(organisation: organisation, city: city, office: office, building: building, floor: 1)
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."organisation" = ? AND "surveys"."city" = ? AND "surveys"."office" = ? AND "surveys"."building" = ? AND "surveys"."floor" = ?  [["organisation", "Wipro"], ["city", "Bangalore"], ["office", "Wipro Corporate Office, Sarjapur"], ["building", "Wipro Corporate Office"], ["floor", "1"]]