app/views/surveys/search.html.erb


              <%= f.collection_select(:organisation, Organisation.order(:name), :id, :name, {:include_blank => 'Organisation'}) %>
---
SELECT "organisations".* FROM "organisations" ORDER BY "organisations"."name" ASC

              <!-- %= f.label :city, "City" % -->
              <%= f.select :city, [''] %>
---
SELECT "cities".* FROM "cities"

              <!-- %= f.label :location, "Location" % -->
              <%= f.select :location, ['All', 'Wipro Electronic City']%>
---
SELECT "locations".* FROM "locations" WHERE "locations"."city_id" = ?  [["city_id", 1]]