app/views/surveys/search.html.erb

SELECT "cities".* FROM "cities" ORDER BY "cities"."name" ASC
---
              <!-- %= f.label :city, "City" % -->
              <%= f.grouped_collection_select :city, Organisation.order(:name), :cities, :name, :name, :name, {:include_blank => 'Select City'}, {id: "city"}  %>