app/views/surveys/search.html.erb

SELECT  "organisations".* FROM "organisations" ORDER BY "organisations"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
              <!-- %= f.label :organisation, "Organisation" % -->
              <%= f.select :organisation, ['Zen', 'Disco', 'Comfy'] %>