app/controllers/surveys_controller.rb

SELECT "surveys"."area" FROM "surveys" WHERE "surveys"."organisation" = ? AND "surveys"."city" = ? AND "surveys"."location" = ? AND "surveys"."unit" = ? AND "surveys"."tower" = ? AND "surveys"."floor" = ? AND "surveys"."ipms" = ? AND "surveys"."component" = ? ORDER BY "surveys"."ipms" DESC  [["organisation", "Zen"], ["city", "Bangalore"], ["location", "Zen Corporate Office, Sarjapur"], ["unit", "EC1"], ["tower", "Tower-1"], ["floor", "1"], ["ipms", "1"], ["component", "Comp A"]]
---
  def searchResults
    if params[:city]
      organisation = params[:organisation]
      city = params[:city]
      location = params[:location]
      unit = params[:unit]
      tower = params[:tower]
      floor = params[:floor]

      @surveys = Survey.where(organisation: organisation, city: city, location: location, unit: unit, tower: tower, floor: 1).order(ipms: :desc)
      if floor and tower and unit and location and city
        @queryString = floor + ", " + tower + ", " + unit + ", " + location +", " + city
      end

      @organisation = organisation
      #send_file Rails.root.join("public", "IPMS1.png"), type: "image/png", disposition: "inline"
      @IPMS1 = "IPMS1.png"
      @IPMS2 = "IPMS2.png"
      @IPMS3 = "IPMS3.png"

      # do the calculation part
      @ipms_1_comp_a = @surveys.where(ipms: 1, component: "Comp A").pluck(:area).first.to_f

SELECT "surveys".* FROM "surveys"
---
  def index
    @surveys = Survey.all