app/controllers/surveys_controller.rb

INSERT INTO "surveys" ("organisation", "city", "location", "unit", "tower", "floor", "area", "building_type", "component", "ipms", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #render plain: params[:survey].inspect
    @survey = Survey.new(survey_params)
    @survey.save

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @survey = Survey.find(params[:id])

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "surveys" SET "office" = ?, "building" = ?, "updated_at" = ? WHERE "surveys"."id" = ?  [["office", "Zen Corporate Office, Sarjapur"], ["building", "Zen Corporate Office"], ["updated_at", "2018-04-14 14:12:22.538779"], ["id", 2]]
---
  def update
    @survey = Survey.find(params[:id])
    if @survey.update(survey_params)

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @survey = Survey.find(params[:id])

SELECT "surveys".* FROM "surveys" WHERE "surveys"."organisation" = ? AND "surveys"."city" = ? AND "surveys"."location" = ? AND "surveys"."unit" = ? AND "surveys"."tower" = ? ORDER BY "surveys"."component" DESC  [["organisation", "Wipro"], ["city", "Bangalore"], ["location", "Wipro Electronic City"], ["unit", "EC-1"], ["tower", "TOWER-1"]]
SELECT "floors"."name" FROM "floors" WHERE "floors"."tower_id" = 1 ORDER BY "floors"."name" ASC
SELECT "floors".* FROM "floors" WHERE "floors"."tower_id" IN (SELECT "towers"."id" FROM "towers" WHERE "towers"."tower" = ?)  [["tower", "TOWER-1"]]
SELECT "towers"."id" FROM "towers" WHERE "towers"."name" = ?  [["name", "TOWER-1"]]
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."organisation" = ? AND "surveys"."city" = ? AND "surveys"."location" = ? AND "surveys"."unit" = ? AND "surveys"."tower" = ? AND "surveys"."ipms" = ? AND "surveys"."component" = ? AND "surveys"."organisation" = ? AND "surveys"."city" = ? AND "surveys"."location" = ? AND "surveys"."unit" = ? AND "surveys"."tower" = ? AND "surveys"."floor" = ? ORDER BY "surveys"."component" DESC, "surveys"."floor" ASC LIMIT ?
---
  def searchResults
    if params[:city]
      organisation = params[:organisation]
      city = params[:city]
      location = params[:location]
      unit = params[:unit]
      tower = params[:tower]
      floor = params[:floor]

      @surveys = Survey.where(organisation: organisation, city: city, location: location, unit: unit, tower: tower).order(component: :desc)
      if floor and tower and unit and location and city
        # @queryString = floor + ", " + tower + ", " + unit + ", " + location +", " + city
        @queryString = tower + ", " + unit + ", " + location + ", " + city
      end

      @organisation = organisation
      #send_file Rails.root.join("public", "IPMS1.png"), type: "image/png", disposition: "inline"

      # IPMS1
      @ipms1_floor_imgs = []
      @ipms_1_floors = 0
      @ipms_1_floors = Floor.where(tower_id: Tower.where(name: tower).pluck(:id)).order(name: :asc).pluck(:name)
      @ipms_1_floors.each do |flr|
        str = "#{@organisation}"+"/"+unit+"/"+"#{@organisation} #{unit} #{tower} #{flr} IPMS-1.png"
        # str = "#{@organisation}"+"/"+unit+"/"+"#{@organisation} #{unit} T-#{tower.scan(/\d+/).last} #{flr} IPMS-1.png"
        @ipms1_floor_imgs.push(str)
      end

      @ipms_1_comp_a_total_area = 0

      @floors_ipms_1_comp_a = @surveys.where(ipms: 1, component: "Comp A", organisation: organisation, city: city, location: location, unit: unit, tower: tower).order(floor: :asc)

SELECT "surveys".* FROM "surveys" ORDER BY "surveys"."organisation" ASC, "surveys"."city" ASC, "surveys"."location" ASC, "surveys"."unit" ASC, "surveys"."tower" ASC, "surveys"."floor" ASC, "surveys"."component" ASC
---
  def index
    @surveys = Survey.all.order(organisation: :asc).order(city: :asc).order(location: :asc).order(unit: :asc).order(tower: :asc).order(floor: :asc).order(component: :asc)

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "surveys" WHERE "surveys"."id" = ?  [["id", 1]]
---
  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy